Console.WriteLine("Введите число: ");
int num = int.Parse(Console.ReadLine());//??"0"

if (num%2 == 0)
{
   Console.WriteLine("Число чётное");
}
else
{
    Console.WriteLine("Число не чётное");
}

//Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
