Console.WriteLine("Введите первое число: ");
int numA = int.Parse(Console.ReadLine());//??"0"
Console.WriteLine("Введите второе число: ");
int numB = int.Parse(Console.ReadLine());//??"0"

if (numA >numB)
{
    Console.WriteLine("Первое число больше");
}
else 
{
    Console.WriteLine("Второе число больше");
}
//Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.